testWeb/app/controllers/second_controller.rb

    def kr
        #NATE
        nate_news = News.where(portal:'nate').take(NEWS_LEN)
        @nate_news = nate_news

        ###################################################DAUM#############################################
        daum_news = []

        #get 記事URL and 取材社名
        urlCor = get_daum_url_cor(DAUM_URL)
        daum_crwal_url = urlCor[0]
        daum_crwal_cor = urlCor[1]

        for index in 0..NEWS_LEN
            news = News.new

            news.url = daum_crwal_url.at(index)

            doc = Nokogiri::HTML(open(news.url))
            news.title   = get_daum_title(doc)
            news.content = get_daum_content(doc)
            news.press   = daum_crwal_cor.at(index)
            news.date    = get_daum_date(doc)
            #add daum news
            daum_news.push(news)
        end

        @daum_news = daum_news

        #NAVER
        naver_news = News.where(portal:'naver').take(NEWS_LEN)
---
SELECT "news".* FROM "news" WHERE "news"."portal" = $1 LIMIT $2  [["portal", "nate"], ["LIMIT", 5]]
SELECT "news".* FROM "news" WHERE "news"."portal" = $1 LIMIT $2  [["portal", "naver"], ["LIMIT", 5]]