testWeb/app/controllers/second_controller.rb

SELECT "news".* FROM "news" WHERE "news"."portal" = $1 LIMIT $2  [["portal", "nate"], ["LIMIT", 5]]
---
    def kr
        #NATE
        nate_news = News.where(portal:'nate').take(NEWS_LEN)